import React, { useContext } from "react";
import "./Analytics.css";
import { LanguageContext } from "../context/LanguageContext";

function Analytics() {
  const { language } = useContext(LanguageContext);

  return (
    <section className="analytics">

      <h1>
        {language === "ru"
          ? "Рекламная аналитика"
          : "Рекламна аналітика"}
      </h1>

      <div className="analytics-block">
        <h2>
          {language === "ru"
            ? "Рекламная Аналитика"
            : "Рекламна аналітика"}
        </h2>

        <p>
          {language === "ru"
            ? 'Прежде чем начать читать этот раздел, хотим поделиться одной мыслью: "Не запускайте рекламу просто по причине дешевизны. Подумайте даст ли она эффект?". Сегодня Вашему бизнесу поступает множество предложений о том где и как можно разместить рекламу. Выбор часто сложен и сопряжен с риском не вернуть свои расходы.'
            : 'Перш ніж почати читати цей розділ, хочемо поділитися однією думкою: "Не запускайте рекламу лише через її дешевизну. Подумайте, чи дасть вона ефект?". Сьогодні Вашому бізнесу надходить безліч пропозицій щодо розміщення реклами. Вибір часто складний і пов’язаний із ризиком не окупити витрати.'}
        </p>

        <button className="read-more">
          {language === "ru" ? "Подробнее..." : "Детальніше..."}
        </button>
      </div>

      <div className="analytics-block">
        <h2>
          {language === "ru"
            ? "Содержание раздела «Рекламная аналитика»"
            : "Зміст розділу «Рекламна аналітика»"}
        </h2>

        <p>
          {language === "ru"
            ? "Здесь Вы найдете список всех статей раздела Рекламная Аналитика"
            : "Тут Ви знайдете список усіх статей розділу Рекламна аналітика"}
        </p>

        <button className="read-more">
          {language === "ru" ? "Подробнее..." : "Детальніше..."}
        </button>
      </div>

      <div className="analytics-block">
        <h2>
          {language === "ru"
            ? "История рекламы на транспорте в г. Одесса"
            : "Історія реклами на транспорті в м. Одеса"}
        </h2>

        <p>
          {language === "ru"
            ? "История рекламы на транспорте в Одессе, как и по всей Украине берет свой старт в начале 90х годов. Это время, когда на наш рынок активно пришли крупные транснациональные западные компании, которые имея опыт рекламы на транспорте в других странах, активно использовали этот канал для продажи своих товаров и услуг. Первыми были реклама на троллейбусах таких компаний как SONY, Coca-Cola, Electrolux и других брендов. Однообразный, неоформленный троллейбусно-трамвайный парк стал идеальным местом для креатива маркетинговых отделов."
            : "Історія реклами на транспорті в Одесі, як і по всій Україні, бере свій початок на початку 90-х років. Це час, коли на наш ринок активно прийшли великі транснаціональні західні компанії, які, маючи досвід реклами на транспорті в інших країнах, активно використовували цей канал для продажу своїх товарів і послуг. Першими були реклама на тролейбусах таких компаній як SONY, Coca-Cola, Electrolux та інших брендів. Одноманітний, неоформлений тролейбусно-трамвайний парк став ідеальним місцем для креативу маркетингових відділів."}
        </p>

        <button className="read-more">
          {language === "ru" ? "Подробнее..." : "Детальніше..."}
        </button>
      </div>

    </section>
  );
}

export default Analytics;